; domain
;; ==========================================================================
;; Domain: Interplanetary Museum Vault (IMV) - Problem 2
;;
;; Extension of Problem 1:
;;  - multiple agent with different capabilities (robotic curator + drone)
;;  - maximum carrying capacity per agent, modelled as a fixed number of
;;     slot objects per robot (kept in plain STRIPS, no numeric
;;     fluents so the domain stays solvable by the same planners as Problem 1)
;; ==========================================================================

(define (domain imv-transport-multi)

  (:requirements :strips :typing :negative-preconditions)

  (:types
    item
    artifact pod - item
    robot location slot
  )

  (:predicates
    (at ?x - item ?l - location)               ; item x (artifact or pod) is at location l
    (robot-at ?r - robot ?l - location)         ; robot r is at location l

    (slot-of ?s - slot ?r - robot)               ; slot s belongs to robot r
    (slot-free ?s - slot)                        ; slot s empty
    (holding ?s - slot ?x - item)                ; slot s holding item x

    (in-pod ?a - artifact ?p - pod)              ; artifact a is secured inside pod p

    (tunnel-connected ?l1 - location ?l2 - location)      ; room <-> maintenance tunnel passage (ground for robot curator)
    (tunnel-beta-connected ?l1 - location ?l2 - location) ; Hall beta (seismic) <-> maintenance tunnel passage (ground for robot curator)
    (is-hall-beta ?l - location)                 ; marks Hall beta for drone flight preconditions

    (sealed ?r - robot)                          ; robot r has sealing mode active (ground robot curator travel only)
    (seismic-active)                             ; a seismic event is currently active

    (can-fly ?r - robot)                         ; robot r is a drone (bypasses the tunnel)
    (can-carry-pod ?r - robot)                   ; robot r is able to carry an anti-vibration pod (only robot curator, not the drone)

    (is-fragile ?a - artifact)                   ; artifact a must be secured in a pod before being moved
    (is-alpha ?a - artifact)                     ; artifact a must be cooled and delivered to the cryo chamber
    (is-core-sample ?a - artifact)                ; artifact a is a martian core sample

    (stabilized ?a - artifact)                   ; artifact a has been secured in a pod
    (cooled ?a - artifact)                   ; artifact a has been cooled
  )

  ;; ---- movement. All rooms are reachable with the maintenance tunnel at the center of the map ------

  (:action move-via-tunnel
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (tunnel-connected ?from ?to) (sealed ?r))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action move-via-tunnel-to-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (tunnel-beta-connected ?from ?to)
                        (sealed ?r) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

;; ---- sealing mode for maintenance tunnel crossing of robot curator ---------------------
  (:action activate-sealing
    :parameters (?r - robot)
    :precondition (not (sealed ?r))
    :effect (sealed ?r)
  )

  (:action deactivate-sealing
    :parameters (?r - robot)
    :precondition (sealed ?r)
    :effect (not (sealed ?r))
  )

  ;; ---- aerial movement for drone. No tunnel sealing needed -----

  (:action fly
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (not (is-hall-beta ?from)) (not (is-hall-beta ?to)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action fly-to-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (is-hall-beta ?to) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action fly-from-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (is-hall-beta ?from) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  ;; ---- handling pods. Robot curator only, requires can-carry-pod ----------------

  (:action pickup-pod
    :parameters (?r - robot ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (at ?p ?l) (can-carry-pod ?r)
                        (slot-of ?s ?r) (slot-free ?s))
    :effect (and (holding ?s ?p) (not (at ?p ?l)) (not (slot-free ?s)))
  )

  (:action putdown-pod
    :parameters (?r - robot ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p))
    :effect (and (at ?p ?l) (slot-free ?s) (not (holding ?s ?p)))
  )

  ;; ---- handling non-fragile artifacts directly -----------------------------

  (:action pickup-artifact
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (at ?a ?l) (not (is-fragile ?a))
                        (slot-of ?s ?r) (slot-free ?s))
    :effect (and (holding ?s ?a) (not (at ?a ?l)) (not (slot-free ?s)))
  )

  (:action putdown-artifact
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?a))
    :effect (and (at ?a ?l) (slot-free ?s) (not (holding ?s ?a)))
  )

  ;; ---- handling fragile artifacts (must go inside a pod) ------
  ;; The robot has to be carrying a pod, travel to the artifact and load it in pod.

  (:action secure-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p)
                        (at ?a ?l) (is-fragile ?a))
    :effect (and (in-pod ?a ?p) (stabilized ?a) (not (at ?a ?l)))
  )

  (:action unload-from-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p) (in-pod ?a ?p))
    :effect (and (at ?a ?l) (not (in-pod ?a ?p)))
  )

  ;; ---- handling alpha artifacts (must be cooled down) ------

  (:action cool
    :parameters (?r - robot ?a - artifact ?s - slot)
    :precondition (and (slot-of ?s ?r) (holding ?s ?a) (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )

 ;; ---- handling fragile alpha artifacts (must be cooled down + put inside a pod) ------
  (:action cool-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?s - slot)
    :precondition (and (slot-of ?s ?r) (holding ?s ?p) (in-pod ?a ?p)
                        (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )
)

; problem
;; ==========================================================================
;; Domain: Interplanetary Museum Vault (IMV) - Problem 2
;;
;; To run with Problem 2 domain.pddl (check README for commands to run)
;; 
;; Checks if a bigger instance forces some plan to use both pods. 
;; Map, robots, and slot capacities unchanged; artifacts are doubled 
;; (now 10: 2 common items, 2 fragile, 2 alpha, 2 core samples, 2 fragile+alpha)
;; ==========================================================================

(define (problem imv-transport-p2-scaleup)
  (:domain imv-transport-multi)

  (:objects
    curator1 - robot
    drone1 - robot
    slot-c1a slot-c1b - slot   ; curator1 has capacity 2
    slot-d1a - slot            ; drone1 has capacity 1
    pod1 pod2 - pod
    art-beta-1   - artifact  ; common item from Hall beta
    art-beta-2   - artifact  ; fragile item from Hall beta
    art-beta-3   - artifact  ; fragile item from Hall beta
    art-beta-4   - artifact  ; common item from Hall beta
    art-alpha-1  - artifact  ; alpha item
    art-alpha-2  - artifact  ; alpha item + fragile
    art-alpha-3  - artifact  ; alpha item + fragile 
    art-alpha-4  - artifact  ; alpha item
    core-sample-1 - artifact ; Martian Core Sample
    core-sample-2 - artifact ; Martian Core Sample
    entrance tunnel anti-vibration-pods hall-alpha hall-beta cryo-chamber stasis-lab - location
  )

  (:init
    ;; robots
    (robot-at curator1 entrance)
    (robot-at drone1 entrance)

    ;; robot slots
    (slot-of slot-c1a curator1)
    (slot-of slot-c1b curator1)
    (slot-free slot-c1a)
    (slot-free slot-c1b)

    ;; drone slots
    (slot-of slot-d1a drone1)
    (slot-free slot-d1a)

    ;; curators' capabilities
    (can-carry-pod curator1)
    (can-fly drone1)

    ;; pods start stored in the Anti-Vibration Pods room
    (at pod1 anti-vibration-pods)
    (at pod2 anti-vibration-pods)

    ;; artifacts' initial locations
    (at art-beta-1 hall-beta)
    (at art-beta-2 hall-beta)
    (at art-beta-3 hall-beta)
    (at art-beta-4 hall-beta)
    (at art-alpha-1 hall-alpha)
    (at art-alpha-2 hall-alpha)
    (at art-alpha-3 hall-alpha)
    (at art-alpha-4 hall-alpha)
    (at core-sample-1 cryo-chamber)
    (at core-sample-2 cryo-chamber)

    ;; artifact characteristics
    (is-fragile art-beta-2)
    (is-fragile art-beta-3)
    (is-alpha art-alpha-1)
    (is-alpha art-alpha-2)
    (is-fragile art-alpha-2)
    (is-alpha art-alpha-3)
    (is-fragile art-alpha-3)
    (is-alpha art-alpha-4)
    (is-core-sample core-sample-1)
    (is-core-sample core-sample-2)

    ;; map topology: unchanged from Problem 2
    (tunnel-connected entrance tunnel)
    (tunnel-connected tunnel entrance)
    (tunnel-connected anti-vibration-pods tunnel)
    (tunnel-connected tunnel anti-vibration-pods)
    (tunnel-connected hall-alpha tunnel)
    (tunnel-connected tunnel hall-alpha)
    (tunnel-connected cryo-chamber tunnel)
    (tunnel-connected tunnel cryo-chamber)
    (tunnel-connected stasis-lab tunnel)
    (tunnel-connected tunnel stasis-lab)

    (tunnel-beta-connected hall-beta tunnel)
    (tunnel-beta-connected tunnel hall-beta)

    (is-hall-beta hall-beta)
  )

  (:goal
    (and
      (at art-beta-1 stasis-lab)
      (stabilized art-beta-2) (at art-beta-2 stasis-lab)
      (stabilized art-beta-3) (at art-beta-3 stasis-lab)
      (at art-beta-4 stasis-lab)
      (cooled art-alpha-1) (at art-alpha-1 cryo-chamber)
      (stabilized art-alpha-2) (cooled art-alpha-2) (at art-alpha-2 cryo-chamber)
      (stabilized art-alpha-3) (cooled art-alpha-3) (at art-alpha-3 cryo-chamber)
      (cooled art-alpha-4) (at art-alpha-4 cryo-chamber)
      (at core-sample-1 stasis-lab)
      (at core-sample-2 stasis-lab)
    )
  )
)

; plan
1. (fly drone1 entrance hall-alpha)
   deleted: (robot-at drone1 entrance)
   added: (robot-at drone1 hall-alpha)
   goals met: 0 of 18
2. (activate-sealing curator1)
   added: (sealed curator1)
   goals met: 0 of 18
3. (move-via-tunnel curator1 entrance tunnel)
   deleted: (robot-at curator1 entrance)
   added: (robot-at curator1 tunnel)
   goals met: 0 of 18
4. (pickup-artifact drone1 art-alpha-1 hall-alpha slot-d1a)
   deleted: (at art-alpha-1 hall-alpha) (slot-free slot-d1a)
   added: (holding slot-d1a art-alpha-1)
   goals met: 0 of 18
5. (cool drone1 art-alpha-1 slot-d1a)
   added: (cooled art-alpha-1)
   goals met: 1 of 18
6. (move-via-tunnel curator1 tunnel anti-vibration-pods)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 anti-vibration-pods)
   goals met: 1 of 18
7. (putdown-artifact drone1 art-alpha-1 hall-alpha slot-d1a)
   deleted: (holding slot-d1a art-alpha-1)
   added: (at art-alpha-1 hall-alpha) (slot-free slot-d1a)
   goals met: 1 of 18
8. (pickup-artifact drone1 art-alpha-4 hall-alpha slot-d1a)
   deleted: (at art-alpha-4 hall-alpha) (slot-free slot-d1a)
   added: (holding slot-d1a art-alpha-4)
   goals met: 1 of 18
9. (cool drone1 art-alpha-4 slot-d1a)
   added: (cooled art-alpha-4)
   goals met: 2 of 18
10. (pickup-pod curator1 pod2 anti-vibration-pods slot-c1a)
   deleted: (at pod2 anti-vibration-pods) (slot-free slot-c1a)
   added: (holding slot-c1a pod2)
   goals met: 2 of 18
11. (move-via-tunnel curator1 anti-vibration-pods tunnel)
   deleted: (robot-at curator1 anti-vibration-pods)
   added: (robot-at curator1 tunnel)
   goals met: 2 of 18
12. (move-via-tunnel curator1 tunnel hall-alpha)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-alpha)
   goals met: 2 of 18
13. (secure-in-pod curator1 art-alpha-2 pod2 hall-alpha slot-c1a)
   deleted: (at art-alpha-2 hall-alpha)
   added: (in-pod art-alpha-2 pod2) (stabilized art-alpha-2)
   goals met: 3 of 18
14. (secure-in-pod curator1 art-alpha-3 pod2 hall-alpha slot-c1a)
   deleted: (at art-alpha-3 hall-alpha)
   added: (in-pod art-alpha-3 pod2) (stabilized art-alpha-3)
   goals met: 4 of 18
15. (cool-in-pod curator1 art-alpha-2 pod2 slot-c1a)
   added: (cooled art-alpha-2)
   goals met: 5 of 18
16. (cool-in-pod curator1 art-alpha-3 pod2 slot-c1a)
   added: (cooled art-alpha-3)
   goals met: 6 of 18
17. (fly-to-beta drone1 hall-alpha hall-beta)
   deleted: (robot-at drone1 hall-alpha)
   added: (robot-at drone1 hall-beta)
   goals met: 6 of 18
18. (pickup-artifact curator1 art-alpha-1 hall-alpha slot-c1b)
   deleted: (at art-alpha-1 hall-alpha) (slot-free slot-c1b)
   added: (holding slot-c1b art-alpha-1)
   goals met: 6 of 18
19. (move-via-tunnel curator1 hall-alpha tunnel)
   deleted: (robot-at curator1 hall-alpha)
   added: (robot-at curator1 tunnel)
   goals met: 6 of 18
20. (fly-from-beta drone1 hall-beta cryo-chamber)
   deleted: (robot-at drone1 hall-beta)
   added: (robot-at drone1 cryo-chamber)
   goals met: 6 of 18
21. (putdown-artifact drone1 art-alpha-4 cryo-chamber slot-d1a)
   deleted: (holding slot-d1a art-alpha-4)
   added: (at art-alpha-4 cryo-chamber) (slot-free slot-d1a)
   goals met: 7 of 18
22. (pickup-artifact drone1 core-sample-1 cryo-chamber slot-d1a)
   deleted: (at core-sample-1 cryo-chamber) (slot-free slot-d1a)
   added: (holding slot-d1a core-sample-1)
   goals met: 7 of 18
23. (move-via-tunnel-to-beta curator1 tunnel hall-beta)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-beta)
   goals met: 7 of 18
24. (secure-in-pod curator1 art-beta-2 pod2 hall-beta slot-c1a)
   deleted: (at art-beta-2 hall-beta)
   added: (in-pod art-beta-2 pod2) (stabilized art-beta-2)
   goals met: 8 of 18
25. (secure-in-pod curator1 art-beta-3 pod2 hall-beta slot-c1a)
   deleted: (at art-beta-3 hall-beta)
   added: (in-pod art-beta-3 pod2) (stabilized art-beta-3)
   goals met: 9 of 18
26. (move-via-tunnel-to-beta curator1 hall-beta tunnel)
   deleted: (robot-at curator1 hall-beta)
   added: (robot-at curator1 tunnel)
   goals met: 9 of 18
27. (move-via-tunnel curator1 tunnel cryo-chamber)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 cryo-chamber)
   goals met: 9 of 18
28. (putdown-artifact curator1 art-alpha-1 cryo-chamber slot-c1b)
   deleted: (holding slot-c1b art-alpha-1)
   added: (at art-alpha-1 cryo-chamber) (slot-free slot-c1b)
   goals met: 10 of 18
29. (fly-to-beta drone1 cryo-chamber hall-beta)
   deleted: (robot-at drone1 cryo-chamber)
   added: (robot-at drone1 hall-beta)
   goals met: 10 of 18
30. (unload-from-pod curator1 art-alpha-2 pod2 cryo-chamber slot-c1a)
   deleted: (in-pod art-alpha-2 pod2)
   added: (at art-alpha-2 cryo-chamber)
   goals met: 11 of 18
31. (unload-from-pod curator1 art-alpha-3 pod2 cryo-chamber slot-c1a)
   deleted: (in-pod art-alpha-3 pod2)
   added: (at art-alpha-3 cryo-chamber)
   goals met: 12 of 18
32. (pickup-artifact curator1 core-sample-2 cryo-chamber slot-c1b)
   deleted: (at core-sample-2 cryo-chamber) (slot-free slot-c1b)
   added: (holding slot-c1b core-sample-2)
   goals met: 12 of 18
33. (move-via-tunnel curator1 cryo-chamber tunnel)
   deleted: (robot-at curator1 cryo-chamber)
   added: (robot-at curator1 tunnel)
   goals met: 12 of 18
34. (fly-from-beta drone1 hall-beta stasis-lab)
   deleted: (robot-at drone1 hall-beta)
   added: (robot-at drone1 stasis-lab)
   goals met: 12 of 18
35. (move-via-tunnel curator1 tunnel stasis-lab)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 stasis-lab)
   goals met: 12 of 18
36. (unload-from-pod curator1 art-beta-2 pod2 stasis-lab slot-c1a)
   deleted: (in-pod art-beta-2 pod2)
   added: (at art-beta-2 stasis-lab)
   goals met: 13 of 18
37. (unload-from-pod curator1 art-beta-3 pod2 stasis-lab slot-c1a)
   deleted: (in-pod art-beta-3 pod2)
   added: (at art-beta-3 stasis-lab)
   goals met: 14 of 18
38. (putdown-artifact drone1 core-sample-1 stasis-lab slot-d1a)
   deleted: (holding slot-d1a core-sample-1)
   added: (at core-sample-1 stasis-lab) (slot-free slot-d1a)
   goals met: 15 of 18
39. (putdown-artifact curator1 core-sample-2 stasis-lab slot-c1b)
   deleted: (holding slot-c1b core-sample-2)
   added: (at core-sample-2 stasis-lab) (slot-free slot-c1b)
   goals met: 16 of 18
40. (fly-to-beta drone1 stasis-lab hall-beta)
   deleted: (robot-at drone1 stasis-lab)
   added: (robot-at drone1 hall-beta)
   goals met: 16 of 18
41. (pickup-artifact drone1 art-beta-1 hall-beta slot-d1a)
   deleted: (at art-beta-1 hall-beta) (slot-free slot-d1a)
   added: (holding slot-d1a art-beta-1)
   goals met: 16 of 18
42. (fly-from-beta drone1 hall-beta stasis-lab)
   deleted: (robot-at drone1 hall-beta)
   added: (robot-at drone1 stasis-lab)
   goals met: 16 of 18
43. (putdown-artifact drone1 art-beta-1 stasis-lab slot-d1a)
   deleted: (holding slot-d1a art-beta-1)
   added: (at art-beta-1 stasis-lab) (slot-free slot-d1a)
   goals met: 17 of 18
44. (fly-to-beta drone1 stasis-lab hall-beta)
   deleted: (robot-at drone1 stasis-lab)
   added: (robot-at drone1 hall-beta)
   goals met: 17 of 18
45. (pickup-artifact drone1 art-beta-4 hall-beta slot-d1a)
   deleted: (at art-beta-4 hall-beta) (slot-free slot-d1a)
   added: (holding slot-d1a art-beta-4)
   goals met: 17 of 18
46. (fly-from-beta drone1 hall-beta stasis-lab)
   deleted: (robot-at drone1 hall-beta)
   added: (robot-at drone1 stasis-lab)
   goals met: 17 of 18
47. (putdown-artifact drone1 art-beta-4 stasis-lab slot-d1a)
   deleted: (holding slot-d1a art-beta-4)
   added: (at art-beta-4 stasis-lab) (slot-free slot-d1a)
   goals met: 18 of 18
